fio/fio--large-file-90-pct-write-1-client-18-worker-2018-10-23-03-45-21.results
hostname=fiotest-51, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.1, flags=1
<fiotest-51> seqwrite: (g=0): rw=rw, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=sync, iodepth=1
<fiotest-51> ...
<fiotest-51> Starting 18 processes
<fiotest-51> fio: pid=10755, err=5/file:backend.c:490, func=full resid, error=Input/output error
seqwrite: (groupid=0, jobs=18): err= 5 (file:backend.c:490, func=full resid, error=Input/output error): pid=10747: Tue Oct 23 03:53:31 2018
   read: IOPS=3, BW=15.3MiB/s (16.0MB/s)(7416MiB/485667msec)
    clat (msec): min=3, max=1211, avg=178.68, stdev=122.26
     lat (msec): min=3, max=1211, avg=178.68, stdev=122.26
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   50], 10.00th=[   69], 20.00th=[   92],
     | 30.00th=[  113], 40.00th=[  132], 50.00th=[  153], 60.00th=[  176],
     | 70.00th=[  201], 80.00th=[  241], 90.00th=[  321], 95.00th=[  414],
     | 99.00th=[  617], 99.50th=[  718], 99.90th=[ 1183], 99.95th=[ 1217],
     | 99.99th=[ 1217]
   bw (  KiB/s): min= 8175, max=32833, per=57.16%, avg=8937.01, stdev=2496.73, samples=1707
   iops        : min=    1, max=    8, avg= 2.16, stdev= 0.61, samples=1707
  write: IOPS=32, BW=128MiB/s (134MB/s)(60.8GiB/485667msec)
    clat (msec): min=22, max=10951, avg=505.84, stdev=384.03
     lat (msec): min=23, max=10952, avg=506.21, stdev=384.03
    clat percentiles (msec):
     |  1.00th=[  188],  5.00th=[  249], 10.00th=[  284], 20.00th=[  334],
     | 30.00th=[  376], 40.00th=[  414], 50.00th=[  456], 60.00th=[  506],
     | 70.00th=[  567], 80.00th=[  634], 90.00th=[  751], 95.00th=[  869],
     | 99.00th=[ 1217], 99.50th=[ 1368], 99.90th=[10000], 99.95th=[10268],
     | 99.99th=[10805]
   bw (  KiB/s): min= 8175, max=41373, per=7.31%, avg=9583.99, stdev=3105.86, samples=13362
   iops        : min=    1, max=   10, avg= 2.31, stdev= 0.76, samples=13362
  lat (msec)   : 4=0.01%, 10=0.10%, 20=0.08%, 50=0.43%, 100=2.08%
  lat (msec)   : 250=10.66%, 500=49.92%, 750=27.52%, 1000=6.86%, 2000=2.22%
  lat (msec)   : >=2000=0.11%
  cpu          : usr=0.07%, sys=0.10%, ctx=17518, majf=0, minf=543
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1855,15556,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=15.3MiB/s (16.0MB/s), 15.3MiB/s-15.3MiB/s (16.0MB/s-16.0MB/s), io=7416MiB (7776MB), run=485667-485667msec
  WRITE: bw=128MiB/s (134MB/s), 128MiB/s-128MiB/s (134MB/s-134MB/s), io=60.8GiB (65.2GB), run=485667-485667msec

Disk stats (read/write):
  sda: ios=16686/140212, merge=0/2, ticks=1800251/39681497, in_queue=41480535, util=100.00%
<fiotest-51> 
client <10.70.56.51>: exited with error 1

Iteration 1 write total throughtput = 131072
Iteration 1 read total throughtput = 15667.2