fio/fio--large-file-90-pct-write-1-client-6-worker-2018-10-23-02-44-38.results
hostname=fiotest-51, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.1, flags=1
<fiotest-51> seqwrite: (g=0): rw=rw, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=sync, iodepth=1
<fiotest-51> ...
<fiotest-51> Starting 6 processes
seqwrite: (groupid=0, jobs=6): err= 0: pid=10002: Tue Oct 23 02:47:50 2018
   read: IOPS=3, BW=13.9MiB/s (14.5MB/s)(2616MiB/188681msec)
    clat (msec): min=3, max=720, avg=69.43, stdev=77.30
     lat (msec): min=3, max=720, avg=69.43, stdev=77.30
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    6], 20.00th=[   13],
     | 30.00th=[   30], 40.00th=[   39], 50.00th=[   48], 60.00th=[   59],
     | 70.00th=[   78], 80.00th=[  109], 90.00th=[  155], 95.00th=[  201],
     | 99.00th=[  368], 99.50th=[  451], 99.90th=[  718], 99.95th=[  718],
     | 99.99th=[  718]
   bw (  KiB/s): min= 6430, max=32833, per=67.46%, avg=9576.81, stdev=3744.23, samples=560
   iops        : min=    1, max=    8, avg= 2.32, stdev= 0.92, samples=560
  write: IOPS=29, BW=116MiB/s (122MB/s)(21.4GiB/188681msec)
    clat (msec): min=30, max=13043, avg=195.44, stdev=431.03
     lat (msec): min=31, max=13043, avg=195.76, stdev=431.03
    clat percentiles (msec):
     |  1.00th=[   61],  5.00th=[   80], 10.00th=[   90], 20.00th=[  100],
     | 30.00th=[  116], 40.00th=[  146], 50.00th=[  184], 60.00th=[  199],
     | 70.00th=[  213], 80.00th=[  236], 90.00th=[  275], 95.00th=[  330],
     | 99.00th=[  550], 99.50th=[  684], 99.90th=[12818], 99.95th=[12953],
     | 99.99th=[13087]
   bw (  KiB/s): min= 8175, max=90021, per=18.31%, avg=21821.31, stdev=9101.85, samples=2059
   iops        : min=    1, max=   21, avg= 5.31, stdev= 2.21, samples=2059
  lat (msec)   : 4=0.05%, 10=1.99%, 20=0.50%, 50=3.30%, 100=21.00%
  lat (msec)   : 250=59.00%, 500=13.00%, 750=0.86%, 1000=0.16%, 2000=0.03%
  lat (msec)   : >=2000=0.10%
  cpu          : usr=0.16%, sys=0.26%, ctx=6179, majf=0, minf=173
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=654,5490,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=13.9MiB/s (14.5MB/s), 13.9MiB/s-13.9MiB/s (14.5MB/s-14.5MB/s), io=2616MiB (2743MB), run=188681-188681msec
  WRITE: bw=116MiB/s (122MB/s), 116MiB/s-116MiB/s (122MB/s-122MB/s), io=21.4GiB (23.0GB), run=188681-188681msec

Disk stats (read/write):
  sda: ios=5890/49446, merge=0/0, ticks=197961/5672123, in_queue=5869682, util=100.00%
<fiotest-51> 
Jobs: 0 (f=0)
Iteration 1 write total throughtput = 118784
Iteration 1 read total throughtput = 14233.6